In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    
    "Column1" : [1 ,2 ,3 ,4 ,5 ,6],
    "Column2" : [100 ,100 ,200 ,300 ,300 ,100],
    "Column3" : ["Mustafa"    ,"Kamil" ,"Emre" ,"Ayşe" ,"Murat" ,"Zeynep"]
           
})

In [3]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [4]:
df.head()

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat

In [5]:
df.head(3)

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre

In [8]:
df["Column2"].unique()

array([100, 200, 300], dtype=int64)

In [10]:
df["Column2"].nunique()

3

In [11]:
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [12]:
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [14]:
df[(df["Column1"] > 2) & (df["Column2"] == 300)]

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat

In [15]:
def times3(x):
    return x * 3

In [16]:
df["Column2"].apply(times3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [19]:
df["Column3"].apply(len)

0    7
1    5
2    4
3    4
4    5
5    6
Name: Column3, dtype: int64

In [20]:
df["Column2"].apply(lambda x : x *2)

0    200
1    200
2    400
3    600
4    600
5    200
Name: Column2, dtype: int64

In [21]:
df.drop("Column1" ,axis =1 ,inplace= True)

In [22]:
df

   Column2  Column3
0      100  Mustafa
1      100    Kamil
2      200     Emre
3      300     Ayşe
4      300    Murat
5      100   Zeynep

In [24]:
df.columns

Index(['Column2', 'Column3'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [26]:
len(df)

6

In [28]:
df.sort_values("Column2" ,ascending = False )

   Column2  Column3
3      300     Ayşe
4      300    Murat
2      200     Emre
0      100  Mustafa
1      100    Kamil
5      100   Zeynep

In [29]:
df.sort_values("Column2" ,ascending = True)

   Column2  Column3
0      100  Mustafa
1      100    Kamil
5      100   Zeynep
2      200     Emre
3      300     Ayşe
4      300    Murat

In [30]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [31]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75

In [33]:
df.pivot_table(index = "Şehir" , columns ="Ay" ,values = "Nem")

Ay        Mart  Mayıs  Nisan
Şehir
Ankara      10     50     25
İstanbul    21     80     67
İzmir       30     75     70

In [36]:
df.pivot_table(index = "Ay" ,columns = "Şehir" ,values="Nem")

Şehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70

In [37]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75